dg-edcharbeneau/esp32-deepgram-voice-agent/sdkconfig.defaults
# Waveshare ESP32-S3-Touch-AMOLED-1.75C -- Deepgram Agent API client
#
# Board hardware (flash geometry, octal PSRAM, console pins/baud) is kept
# identical to the sibling spec_analyzer_radial project so the same
# `idf.py -b 2000000 monitor` habit works across both.
#
CONFIG_IDF_TARGET="esp32s3"

# --- flash / PSRAM / clocks -------------------------------------------------
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=4096
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000

# --- console ---------------------------------------------------------------
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=2000000

# --- TLS -------------------------------------------------------------------
# The agent endpoint is wss://, so the connection needs a root store. The
# bundled Mozilla CA set covers api/agent.deepgram.com without shipping a PEM.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# TLS record buffers live in PSRAM; the handshake alone wants ~16 kB inbound.
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# --- Wi-Fi -----------------------------------------------------------------
# Agent audio arrives as a steady stream of ~4 kB binary frames; the extra RX
# buffers keep the stack from dropping them under a burst.
#
# TRIED AT 8 AND REVERTED, 2026-09-01. Halving these did what it was supposed to
# -- 12.8 kB back into the DMA-capable pool, and the esp-aes allocation failures
# that were dropping Deepgram sessions went to zero. It also introduced a worse
# failure:
#
#   E websocket_client: Could not lock ws-client within 2000 timeout
#   E transport_ws: Error transport_poll_write(0)
#   W dg_agent: socket closed (status 0)
#
# Zero occurrences of that in every capture before the change; six in the first
# capture after it. Fewer RX buffers means the MAC defers frames under a burst,
# TCP stalls, and a TLS write sits in the socket for the full 2 s SEND_TIMEOUT
# holding the websocket client's mutex -- so every other sender times out trying
# to take it and the session dies anyway. A memory fault traded for a stall.
#
# The warning above is therefore load-bearing, and the 12% rise in dropped audio
# that came with the change was the leading edge of it rather than an acceptable
# price. Take DMA-capable memory from DRAW_ROWS in main/ui.c instead; that one
# costs render granularity, not packets.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=48
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=48
CONFIG_LWIP_TCP_WND_DEFAULT=32768
CONFIG_LWIP_TCP_RECVMBOX_SIZE=32
# The send side matters as much as the receive side here, and the stock 5760 is
# only 4 x MSS -- 180 ms of the 32 kB/s mic stream. Once it fills, the socket
# reports unwritable, esp_transport_ssl_write() returns 0 on the poll timeout,
# and the WebSocket client treats that as fatal and reconnects (the agent then
# re-greets). 23040 is 16 x MSS, ~700 ms of audio, so an ordinary Wi-Fi
# retransmission burst no longer ends the session. It is a ceiling, not a
# preallocation: the memory is only used when the link is actually backed up.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=23040

# CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK IS DELIBERATELY LEFT OFF. Do not turn it
# on to cure "Could not lock ws-client" -- it was tried here and it HANGS THE
# CLIENT PERMANENTLY. Its send-error path (esp_websocket_client.c, the
# CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK branch) releases tx_lock and then takes
# client->lock with portMAX_DELAY, an unbounded wait the single-lock path does
# not have because it already holds that lock. On the device this wedged the
# client after a send error: Settings, PING and then CLOSE all timing out every
# 2 s forever, with no recovery short of a reboot.
#
# The lock timeouts that motivated it were self-inflicted anyway -- they came
# from a 200 ms AUDIO_SEND_TIMEOUT, which is also the lock deadline. See the
# comment on AUDIO_SEND_TIMEOUT in main/dg_agent.c.

# --- LVGL / display --------------------------------------------------------
# CLIB malloc is not about the 434 kB canvas (those pixels are heap_caps_malloc'd
# directly). It is about LVGL's builtin allocator, which with the default
# CONFIG_LV_MEM_SIZE_KILOBYTES=64 emits a 64 kB `work_mem_int` array in INTERNAL
# .bss. That array is linker-discarded today only because nothing references the
# allocator; adding display code would make it real, and internal RAM is the one
# thing this project cannot spare.
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_OBJ_STYLE_CACHE=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_FONT_MONTSERRAT_24=y
# Deliberately NOT raising CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT above 1: LVGL creates
# its draw threads with a plain xTaskCreate, so they get no core affinity and
# would float onto the Wi-Fi core with an 8 kB internal stack each. Staying at 1
# also keeps CONFIG_LV_OS_NONE valid -- the adapter uses its own recursive mutex
# and does not need LV_OS_FREERTOS; only DRAW_UNIT_CNT > 1 does.

# --- app -------------------------------------------------------------------
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

# Setup QR code on the provisioning screen (main/wifi_prov.c). Off by default in
# LVGL; the encoder is a few kB and only instantiated while the portal is up.
CONFIG_LV_USE_QRCODE=y

# --- crash diagnostics -----------------------------------------------------
#
# The default canary stack-overflow check only looks at a context switch, so a
# deep overflow corrupts neighbouring memory and crashes somewhere else first --
# which is exactly how the esp-sr AEC bring-up presented: an abort on core 0 with
# no overflow message anywhere near the actual fault. The watchpoint method traps
# at the instruction that overruns, with a backtrace that names the real culprit.
#
# It costs one of the two hardware watchpoints, which nothing else here uses.
# Note this is a separate boolean, NOT a member of the
# FREERTOS_CHECK_STACKOVERFLOW choice -- that choice only offers none/ptrval/
# canary in IDF 5.5, and setting a non-existent option fails silently.
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y

# A full core dump over serial, decodable offline with espcoredump.py. No
# partition needed, unlike the flash variant, and it survives the reboot that
# follows a panic -- which matters on a board whose USB link is easy to lose.
CONFIG_ESP_COREDUMP_ENABLE_TO_UART=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y

# Speaker volume. A PREFERENCE, not a constraint -- and it was written as a
# constraint first, which was wrong.
#
# The claim was that echo cancellation forces a low volume: an archived table
# put this board's amplifier into non-linearity between 85 and 100, requiring
# 30.1 dB of ERLE against ~19 delivered. Measured on hardware 2026-08-30 that
# does not hold -- 23.2 dB mean at volume 100 against 22.4 at 70, barge-in
# firing at both, and a ~22 minute session at 100 with zero allocation failures.
#
# 70 stays the default for an ordinary reason: 100 audibly clips on this
# speaker. Nothing breaks if it is raised, and CONFIG_AEC_FULL_DUPLEX_MAX_VOLUME
# no longer gates anything at its default of 100.
#
# Note volume_load() prefers the NVS-saved level over this default, so a device
# already set to something else stays there until NVS is erased.
CONFIG_AUDIO_OUT_VOLUME=70

# --- WebSocket client ------------------------------------------------------
# SENDS GET THEIR OWN LOCK, and without this they do not.
#
# The client task holds client->lock across its whole receive loop. With one
# lock, an audio frame from dg_uplink has to take that same mutex, so a receive
# side blocked in a TLS read makes the send wait -- and it waits with a 2 s
# deadline, after which:
#
#   E websocket_client: Could not lock ws-client within 2000 timeout
#   E transport_ws: Error transport_poll_write(0)
#   W dg_agent: socket closed (status 0)
#
# Measured 2026-09-01: zero occurrences across four captures while a memory
# fault was killing sessions first, then 2-6 per capture in every build after
# that fault was fixed. It was never new -- sessions simply had not been
# surviving long enough to reach it.
#
# NOT THE SAME THING as the transmit mutex docs/session-control.md warns about.
# That warning is about adding OUR OWN lock outside the client's, which
# deadlocks: the control task holds ours and waits on the client's while the
# client task holds its own and waits on ours through send_settings(). This is
# the client's own internal tx_lock, ordered inside its own locking, which is
# the sanctioned way to get the same decoupling.
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y
